docs/testing/evidence/issue-13/load-output.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: k6/order-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 19s max duration (incl. graceful stop):
              * order_load: Up to 2 looping VUs for 14s over 3 stages (gracefulRampDown: 5s, gracefulStop: 5s)


running (01.0s), 0/2 VUs, 0 complete and 0 interrupted iterations
order_load   [   0% ] 0/2 VUs  00.0s/14.0s

running (02.0s), 0/2 VUs, 0 complete and 0 interrupted iterations
order_load   [   7% ] 0/2 VUs  01.0s/14.0s

running (03.0s), 0/2 VUs, 0 complete and 0 interrupted iterations
order_load   [  14% ] 0/2 VUs  02.0s/14.0s

running (04.0s), 0/2 VUs, 0 complete and 0 interrupted iterations
order_load   [  22% ] 0/2 VUs  03.0s/14.0s

running (05.0s), 1/2 VUs, 1 complete and 0 interrupted iterations
order_load   [  29% ] 1/2 VUs  04.0s/14.0s

running (06.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
order_load   [  36% ] 1/2 VUs  05.0s/14.0s

running (07.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
order_load   [  43% ] 1/2 VUs  06.0s/14.0s

running (08.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
order_load   [  50% ] 1/2 VUs  07.0s/14.0s

running (09.0s), 1/2 VUs, 13 complete and 0 interrupted iterations
order_load   [  57% ] 1/2 VUs  08.0s/14.0s

running (10.0s), 1/2 VUs, 16 complete and 0 interrupted iterations
order_load   [  64% ] 1/2 VUs  09.0s/14.0s

running (11.0s), 1/2 VUs, 19 complete and 0 interrupted iterations
order_load   [  72% ] 1/2 VUs  10.0s/14.0s

running (12.0s), 2/2 VUs, 23 complete and 0 interrupted iterations
order_load   [  79% ] 2/2 VUs  11.0s/14.0s

running (13.0s), 2/2 VUs, 29 complete and 0 interrupted iterations
order_load   [  86% ] 2/2 VUs  12.0s/14.0s

running (14.0s), 1/2 VUs, 36 complete and 0 interrupted iterations
order_load   [  93% ] 1/2 VUs  13.0s/14.0s

running (15.0s), 1/2 VUs, 40 complete and 0 interrupted iterations
order_load ↓ [ 100% ] 1/2 VUs  14s


  █ THRESHOLDS

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1000' p(95)=293.96ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    order_error_rate
    ✓ 'rate<0.01' rate=0.00%

    order_success_rate
    ✓ 'rate>0.99' rate=100.00%


  █ TOTAL RESULTS

    checks_total.......: 125     8.208521/s
    checks_succeeded...: 100.00% 125 out of 125
    checks_failed......: 0.00%   0 out of 125

    ✓ synthetic user charged
    ✓ order returns 201
    ✓ order response content type is JSON
    ✓ order response JSON has required fields

    CUSTOM
    order_error_rate...............: 0.00%   0 out of 41
    order_success_rate.............: 100.00% 41 out of 41

    HTTP
    http_req_duration..............: avg=130.16ms min=46.97ms  med=78.27ms  max=900.61ms p(90)=230.42ms p(95)=293.96ms count=43
      { expected_response:true }...: avg=130.16ms min=46.97ms  med=78.27ms  max=900.61ms p(90)=230.42ms p(95)=293.96ms count=43
    http_req_failed................: 0.00%   0 out of 43
    http_reqs......................: 43      2.823731/s

    EXECUTION
    iteration_duration.............: avg=313.92ms min=247.31ms med=278.92ms max=736.58ms p(90)=420.67ms p(95)=437.71ms count=41
    iterations.....................: 41      2.692395/s
    vus............................: 1       min=0        max=2
    vus_max........................: 2       min=2        max=2

    NETWORK
    data_received..................: 11 kB   750 B/s
    data_sent......................: 6.9 kB  456 B/s



running (15.2s), 0/2 VUs, 41 complete and 0 interrupted iterations
order_load ✓ [ 100% ] 0/2 VUs  14s